
import { QuestionType } from '../../types';

interface QuestionContent {
  id: number;
  type: QuestionType;
  content: string;
}

export const blankQuestionsPart2: QuestionContent[] = [
  {
    id: 104,
    type: 'blank',
    content: "已知离散系统差分方程为 \\(y(n) + 3y(n-1) + 2y(n-2) = x(n)\\)，激励 \\(x(n)=2^n u(n)\\)，初始状态 \\(y(0)=0, y(1)=2\\)。求时域分析法求零输入响应 \\(y_{zi}(n)\\) 和零状态响应 \\(y_{zs}(n)\\) 。"
  },
  {
    id: 105,
    type: 'blank',
    content: "设一连续时间系统满足微分方程 \\(\\frac{dy(t)}{dt} + ay(t) = x(t)\\)，若有一离散时间系统，其单位阶跃响应 \\(g(n)\\) 等于前述连续时间系统的单位阶跃响应 \\(g_c(t)\\) 之抽样，即 \\(g(n)=g_c(nT)\\)，求此离散系统的差分方程表达式。"
  },
  {
    id: 106,
    type: 'blank',
    content: "某线性时不变离散系统，激励为 \\(x(n)\\) 时，全响应为 \\(y_1(n) = u(n)\\)；若起始状态不变，激励为 \\(-x(n)\\) 时，全响应为 \\(y_2(n) = [2\\cdot 3^n - 1]u(n)\\)。求起始状态为原来的 2 倍且激励为 \\(3x(n)\\) 时系统全响应 \\(y_3(n)\\)。"
  },
  {
    id: 107,
    type: 'blank',
    content: "已知 \\(r(t) = e(t) * h(t)\\)，\\(g(t) = e(3t) * h(3t)\\)，且 \\(r(t)、h(t)\\) 的傅里叶变换分别为 \\(R(\\omega)\\) 和 \\(H(\\omega)\\)。证明 \\(g(t) = Ar(Bt)\\)，并求 A、B 的值。"
  },
  {
    id: 108,
    type: 'blank',
    content: "已知线性非时变离散系统的差分方程为：\\(y(n) - 5y(n-1) + 6y(n-2) = x(n)\\)，且 \\(x(n) = 2u(n)\\)，\\(y(-1)=1, y(-2)=0\\)。求：(1)试用z分析法求差分方程的解\\(y(n)\\);(2)求系统函数H(z)及其单位样值响应h(n)。"
  },
  {
    id: 109,
    type: 'blank',
    content: "一线形时不变连续系统，当起始状态 \\(x(0_-)=1\\)，输入 \\(f_1(t)=2u(t)\\) 时，全响应为 \\(y_1(t)=3e^{-2t}u(t)\\)；当 \\(x(0_-)=2\\)，输入 \\(f_2(t)=\\delta(t)\\) 时，全响应为 \\(y_2(t)=3e^{-2t}u(t)\\)，求系统冲激响应 \\(h(t)\\)。"
  },
  {
    id: 110,
    type: 'blank',
    content: "描述线性时不变连续系统的微分方程为 \\(r''(t)+4r'(t)+4r(t) = e'(t)+3e(t)\\)，输入 \\(e(t)=e^{-t}u(t)\\)，\\(r(0_-)=1, r'(0_-)=3\\)。求系统零输入响应 \\(r_{zi}(t)\\) 零输入响应 \\(r_{zs}(t)\\) 。"
  },
  {
    id: 111,
    type: 'blank',
    content: "描述某线性时不变系统输入与输出关系的系统函数为 \\(H(s) = \\frac{s^2+5}{s^2+2s+5}\\)，已知起始条件 \\(r(0_-)=0，r'(0_-)=-2\\)，输入 \\(e(t)=u(t)\\)，求系统完全响应。"
  },
  {
    id: 112,
    type: 'blank',
    content: "二阶线性时不变系统 \\(\\frac{d^2r(t)}{dt^2} + a_0 \\frac{dr(t)}{dt} + a_1r(t) = b_0 \\frac{de(t)}{dt} + b_1 e(t)\\)，激励为 \\(e^{-2t}u(t)\\) 时，全响应为 \\([-e^{-t} + 4e^{-2t} - e^{-3t}]u(t)\\)；激励为 \\(\\delta(t) - 2e^{-2t}u(t)\\) 时，全响应为 \\([3e^{-t} + e^{-2t} - 5e^{-3t}]u(t)\\)，起始状态固定。求：(1)系数 \\(a_0, a_1\\)；(2) \\(r_{zi}(t)\\) 和 \\(h(t)\\)；(3)系数 \\(b_0, b_1\\)。"
  },
  {
    id: 113,
    type: 'blank',
    content: "已知离散系统差分方程为 \\(y(n+2) + 6y(n+1) + 8y(n) = x(n+2) + 5x(n+1) + 12x(n)\\)，若 \\(x(n)=u(n)\\) 时系统响应为 \\(y(n) = [1.2 + (-2)^{n+1} + 2.8 \\cdot (-4)^n]u(n)\\)。(1)判断该系统的稳定性；(2)计算零输入初始条件 \\(y_{zi}(0)、y_{zi}(1)\\) 及激励引起的初始值 \\(y_{zs}(0)、y_{zs}(1)\\)。"
  },
  {
    id: 114,
    type: 'blank',
    content: "已知某系统激励为 \\(f_1(t) = e^{-3t}u(t)\\) 时，零状态响应为 \\(y_1(t)\\)；激励为 \\(f_2(t) = f_1'(t) + 3\\int_{-\\infty}^t f_1(\\tau)d\\tau\\) 时，响应为 \\(y_2(t) = -4y_1(t) + e^{-2t}u(t)\\)，求冲激响应 \\(h(t)\\)。"
  },
  {
    id: 115,
    type: 'blank',
    content: "线性时不变系统，在以下三种情况下的初始条件全同。已知当激励 \\(e_1(t) = \\delta(t)\\) 时，其全响应 \\(r_1(t) = \\delta(t) + e^{-t}u(t)\\)；当激励 \\(e_2(t) = u(t)\\) 时，其全响应 \\(r_2(t) = 3e^{-t}u(t)\\)。求当激励 \\(e_3(t) = tu(t) - (t-1)u(t-1) - u(t-1)\\) 时的全响应 \\(r_3(t)\\)。"
  },
  {
    id: 116,
    type: 'blank',
    content: "描述线性时不变离散系统的差分方程组为 \\(y_1(n) - 4y_1(n-1) - y_2(n) = x(n-1)\\)，\\(y_1(n-1) + 2y_1(n-2) + y_2(n) + 2y_2(n-1) = x(n) - 3x(n-1)\\)。其中，\\(x(n)\\) 为激励，\\(y_1(n)、y_2(n)\\) 为系统的两个输出。求 \\(H_1(z) = \\frac{Y_{1zs}(z)}{X(z)}、H_2(z) = \\frac{Y_{2zs}(z)}{X(z)}\\)。"
  },
  {
    id: 117,
    type: 'blank',
    content: "已知某离散系统的差分方程为 \\(2y(n+2) - 3y(n+1) + y(n) = x(n+1)\\)，其初始状态为 \\(y_{zi}(-1) = -2，y_{zi}(-2) = -6\\)，激励 \\(x(n)=u(n)\\)。求：1) 零输入响应 \\(y_{zi}(n)\\)；2) 指出其中的自由响应分量和受迫响应分量；3) 判断该系统的稳定性。"
  },
  {
    id: 118,
    type: 'blank',
    content: "某系统的微分方程为 \\(r''(t) + 5r'(t) + 6r(t) = e''(t) + 3e'(t) + 3e(t)\\)，激励为 \\(e(t) = u(t) + e^{-t}u(t)\\)，全响应为 \\(r(t) = (4e^{-2t} - \\frac{4}{3}e^{-3t} + \\frac{1}{3})u(t)\\) ，求系统的零状态响应 \\(r_{zs}(t)\\)，零输入响应 \\(r_{zi}(t)\\) 及 \\(r_{zi}(0_+)\\)。"
  },
  {
    id: 119,
    type: 'blank',
    content: "某线性时不变连续时间系统的起始状态一定。已知当激励 \\(e_1(t)=\\delta(t)\\) 时，其全响应 \\(r_1(t)=-e^{-t}u(t)\\)；当激励 \\(e_2(t)=u(t)\\) 时，其全响应 \\(r_2(t)=(1-5e^{-t})u(t)\\)。求系统的冲激响应 \\(h(t)\\)。"
  },
  {
    id: 120,
    type: 'blank',
    content: "已知某线性时不变离散时间系统的单位阶跃响应为 \\(g(n) = [\\frac{4}{3} - \\frac{3}{7} \\cdot 0.5^n + \\frac{2}{21} \\cdot (-0.2)^n]u(n)\\)，若零状态响应为 \\(y_{zs}(n) = \\frac{10}{7}[0.5^n - (-0.2)^n]u(n)\\)，求输入的激励信号 \\(x(n)\\)。"
  },
  {
    id: 121,
    type: 'blank',
    content: "已知离散时间系统差分方程为 \\(y(n+2) + 3y(n+1) + 2y(n) = x(n+1) - x(n)\\)，\\(x(n) = (-2)^n u(n)\\)，零输入初始条件为 \\(y_{zi}(0) = 0，y_{zi}(1) = 1\\)。求零输入响应、零状态响应、全响应，并指出强迫响应与自由响应分量。"
  },
  {
    id: 122,
    type: 'blank',
    content: "已知二阶离散系零输入初始条件为 \\(y_{zi}(0) = 2，y_{zi}(1) = 1\\)。当输入 \\(x(n) = u(n)\\) 时，输出响应为 \\(y(n) = [0.5 + 4 \\cdot 2^n - 2.5 \\cdot 3^n]u(n)\\)。求此系统差分方程。"
  }
];
